"use strict";

// Условные операторы

// Важно знать
    // Операции сравнения всегда будут возвращать одно из след значений
    // TRUE = истина
    // FALSE = ложь

// alert(2==4); // == - операция сравнения

// alert(8 > 4); // операция сравнения на большинство
// alert(8 < 10 ); // операция сравнения на меньшинство

// alert(4 <= 4 ); // меньше или равно
// alert(4 >= 5 ); // больше или равно

// alert(12 != 5); // не равно

// alert("Alex" == "Alex");

// alert("2" == 2);
// Когда происходит операция сравнения Значения конвертируются в цифры
// все что заключено в кавычки это текст!
// без кавычек = числа

// alert("2" === 2);
// == сравнение значений. (она конвертирует текст в число)
// === сравнение типов данных + значения


// Условные операторы

// if - если
// else - в противном случае

// если 2 равно 2 то, выполни след условие, выведи на экран сообщение "ответ правильный", в противном случае выведи "ответ не верный"

// если 2 равно 2
    // Решение: if (2==2)

// то 
    //  Решение: {

    // }

// выведи на экран сообщение "ответ правильный"
    // Решение: alert("ответ правильный")

// в противном случае
    // Решение: else{}

// выведи на экран сообщение "ответ  не правильный"
    // Решение: alert("ответ не правильный")

if(4==2){
    alert("ответ правильный");
} else{
    alert("ответ  не правильный");
}